/*______________________________________________________________________________________________________________*/
/*																												*/
/*												   ÇªÇÃëº ACTION												*/
/*______________________________________________________________________________________________________________*/

#include <windows.h>
#include "Def.h"
#include "Work.h"

/*______________________________________________________*/
/*				    	ÉèÅ[Évèàóù						*/
/*ÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅP*/
void ActWarp( void )
{
	int i ;
	int pl , py , pr ;									// PLAYER ÇÃÇ†ÇΩÇËîªíË

	int Holeup[][4] = {
//		{ up , down , left , right } ,
		{  70 , 128 ,   0 ,  96 } ,						// ç∂è„ÇÃ 0î‘ ÇÃìyä«
		{  70 , 128 , 704 , 800 } ,						// âEè„ÇÃ 1î‘ ÇÃìyä«
		{ 550 , 580 ,   0 ,  96 } ,						// ç∂è„ÇÃ 2î‘ ÇÃìyä«
		{ 550 , 580 , 704 , 800 } ,						// âEè„ÇÃ 3î‘ ÇÃìyä«
	} ;

	/*
		ÉvÉåÉCÉÑÅ[ÇÃÇ†ÇΩÇËîªíË
		 > 3Ç¬Ç†ÇΩÇËîªíËÇÇ∆ÇÈ
	*/
	py = (int)pp->yp ;									// ÉvÉåÉCÉÑÅ[ÇÃíÜêSì_
	pl = (int)(pp->xp - 15.0) ;							// ÉvÉåÉCÉÑÅ[ÇÃç∂ë´
	pr = (int)(pp->xp + 15.0) ;							// ÉvÉåÉCÉÑÅ[ÇÃâEë´

	/*
		ìyä«ÇÃÇ†ÇΩÇËîªíË
	*/
	for ( i = 0 ; i < 4 ; i++ )
	{
		if ( (py >= Holeup[i][0]) && (py <= Holeup[i][1]) )	// è„â∫ÇÃÇ†ÇΩÇËîªíË
		{
			if ( (i == 0) || (i == 1) )
			{
				// ç∂ë§Ç…ì¸ÇÈÇ∆Ç´
				if ( (pl >= Holeup[0][2]) && (pl <= Holeup[0][3])
					|| (pr >= Holeup[1][2]) && (pr <= Holeup[1][3]) )	  // ÉvÉåÉCÉÑÅ[  ÇÃâEë´Ç∆ÉuÉçÉbÉNÇÃÇ†ÇΩÇËîªíË
				{
					pp->yp = 86 ;							// ìñÇΩÇ¡ÇΩ BLOCK ÇÃç¿ïWÇìnÇ∑
					pp->pchg[4] = 1 ;						// ìyä«ÇÃíÜÇ©Ç«Ç§Ç©ÇÃÉtÉâÉO			
				}
				else
				{
					pp->pchg[4] = 0 ;						// ìyä«ÇÃíÜÇ©Ç«Ç§Ç©ÇÃÉtÉâÉO			
				}
			}

			if ( (i == 2) || (i == 3) )
			{
				// ç∂ë§Ç…ì¸ÇÈÇ∆Ç´
				if ( (pl >= Holeup[2][2]) && (pl <= Holeup[2][3])
					|| (pr >= Holeup[3][2]) && (pr <= Holeup[3][3]) )	// ÉvÉåÉCÉÑÅ[ÇÃâEë´Ç∆ÉuÉçÉbÉNÇÃÇ†ÇΩÇËîªíË
				{
					pp->yp = 566 ;							// ìñÇΩÇ¡ÇΩ BLOCK ÇÃç¿ïWÇìnÇ∑
					pp->pchg[4] = 1 ;						// ìyä«ÇÃíÜÇ©Ç«Ç§Ç©ÇÃÉtÉâÉO			
				}
				else
				{
					pp->pchg[4] = 0 ;						// ìyä«ÇÃíÜÇ©Ç«Ç§Ç©ÇÃÉtÉâÉO			
				}
			}
			pp->yspd = 0 ;
		}
	}

	if ( pp->xp < 0 )
	{
		pp->xp = WINDOW_W - 10 ;
	}
	if ( pp->xp > WINDOW_W )
	{
		pp->xp = 10 ;
	}

	// 0î‘ñ⁄ÇÃìyä« ( ç∂è„ )
	if ( (pp->xp > 0) && (pp->xp < 32) && (pp->yp > 64) && (pp->yp < 160) )
	{
		// âEâ∫ÇÃ3î‘ñ⁄ÇÃìyä«Ç…îÚÇ‘
		pp->xp = 736.0 ;								// âEë§ÇÃç¿ïW
		pp->yp = FLIMIT ;								// ínñ ÇÃç¿ïW
	}

	// 1î‘ñ⁄ÇÃìyä« ( âEè„ )
	if ( (pp->xp > 768.0) && (pp->xp < WINDOW_W) && (pp->yp > 64) && (pp->yp < 160) )
	{
		// ç∂â∫ÇÃ2î‘ñ⁄ÇÃìyä«Ç…îÚÇ‘
		pp->xp = 64.0 ;									// ç∂ë§ÇÃç¿ïW
		pp->yp = FLIMIT ;								// ínñ ÇÃç¿ïW
	}

	// 2î‘ñ⁄ÇÃìyä« ( ç∂â∫ )
	if ( (pp->xp > 0) && (pp->xp < 32) && (pp->yp > (FLIMIT-32)) && (pp->yp < (FLIMIT+32)) )
	{
		// âEè„ÇÃ2î‘ñ⁄ÇÃìyä«Ç…îÚÇ‘
		pp->xp = 736.0 ;								// âEë§ÇÃç¿ïW
		pp->yp = 96.0 ;									// è„ÇÃÉuÉçÉbÉNè∞ÇÃç¿ïW
	}

	// 3î‘ñ⁄ÇÃìyä« ( âEâ∫ )
	if ( (pp->xp > 768.0) && (pp->xp < WINDOW_W) && (pp->yp > (FLIMIT-32)) && (pp->yp < (FLIMIT+32)) )
	{
		// ç∂è„ÇÃ0î‘ñ⁄ÇÃìyä«Ç…îÚÇ‘
		pp->xp = 64.0 ;									// ç∂ë§ÇÃç¿ïW
		pp->yp = 96.0 ;									// è„ÇÃÉuÉçÉbÉNè∞ÇÃç¿ïW
	}


}

/*______________________________________________________*/
/*						ìyä«ÇÃîzíu						*/
/*ÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅP*/
void ActHole( void )
{
	int HoleTbl[4][3] = {
		{  50 , 100 , 100 } ,							// 0î‘ÇÃìyä«
		{ 750 , 100 ,   0 } ,							// 1î‘ÇÃìyä«
		{  50 , 578 , 100 } ,							// 2î‘ÇÃìyä«
		{ 750 , 578 ,   0 } ,							// 3î‘ÇÃìyä«
	} ;

	switch ( pp->mode )
	{
		case 0 :
			pp->dspf = 1 ;								// ÇOÅFîÒï\é¶	1ÅFï\é¶
			pp->xsize = 100 ;							// ÇwÉTÉCÉY
			pp->ysize = 100 ;							// ÇxÉTÉCÉY
			pp->yboff = 0 ;								// ÇxÉIÉtÉZÉbÉg
			pp->ymoff = 100 ;							// ÇxÉ}ÉXÉN
			pp->xoff = -50 ;							// ÇwÉ}ÉXÉN
			pp->yoff = -100 ;							// ÇxÉ}ÉXÉN
			pp->idx = 8 ;								// âÊëúî‘çÜ
			pp->mode = 1 ;								// ÉAÉNÉVÉáÉìä«óùî‘çÜ

			pp->xp = (double)HoleTbl[pp->cnt][0] ;		// ÉXÉNÉäÅ[ÉìÇwç¿ïW
			pp->yp = (double)HoleTbl[pp->cnt][1] ;		// ÉXÉNÉäÅ[ÉìÇxç¿ïW
			pp->xboff = HoleTbl[pp->cnt][2] ;			// ÇwÉIÉtÉZÉbÉg
			pp->xmoff = HoleTbl[pp->cnt][2] ;			// ÇwÉ}ÉXÉN
			break ;

		case 1 :
			break ;

	}
}



